package lesson_10_10_2024_for;
//Задание: 2
//Вывести на экран в одну строку все нечётные числа от 0 до 100.
public class lesson_task3 {

    public static void main(String[] args) {
        for (int i = 1; i < 100; i += 2) {
            System.out.print(i + " ");
        }
    }
}
